### CHAPTER 7
# Data Cleaning and Preparation

In [163]:
import pandas as pd
import numpy as np

In [164]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [165]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [166]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [167]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [168]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [169]:
float_data.isnull()

0    False
1    False
2     True
dtype: bool

In [170]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [171]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [172]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [173]:
data.dropna()  # Drops any row with NaN values

     0    1    2
0  1.0  6.5  3.0

In [174]:
data.dropna(how='all')  # Drops any row with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [175]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [176]:
data.dropna(axis="columns", how='all')  # Drops any column with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [177]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  1.239201  0.894161  2.009278
1 -0.118521  2.315238  0.309969
2  1.485005 -1.108452  0.530194
3  0.126152 -1.135747  0.110065
4  0.505513 -0.862815  0.308921
5  0.259790 -0.118893  0.886090
6  0.582531  0.769109  1.058790

In [178]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.239201       NaN       NaN
1 -0.118521       NaN       NaN
2  1.485005       NaN  0.530194
3  0.126152       NaN  0.110065
4  0.505513 -0.862815  0.308921
5  0.259790 -0.118893  0.886090
6  0.582531  0.769109  1.058790

In [179]:
df.dropna()

          0         1         2
4  0.505513 -0.862815  0.308921
5  0.259790 -0.118893  0.886090
6  0.582531  0.769109  1.058790

In [180]:
df.dropna(thresh=2)  # Keep only rows with at least 2 non-NaN values

          0         1         2
2  1.485005       NaN  0.530194
3  0.126152       NaN  0.110065
4  0.505513 -0.862815  0.308921
5  0.259790 -0.118893  0.886090
6  0.582531  0.769109  1.058790

### Filling In Missing Data

In [181]:
df.fillna(0)  # Fill NaN values with 0

          0         1         2
0  1.239201  0.000000  0.000000
1 -0.118521  0.000000  0.000000
2  1.485005  0.000000  0.530194
3  0.126152  0.000000  0.110065
4  0.505513 -0.862815  0.308921
5  0.259790 -0.118893  0.886090
6  0.582531  0.769109  1.058790

In [182]:
df.fillna({1:0.5, 2:0})  # Fill NaN values in column 1 with 0.5 and column 2 with 0

          0         1         2
0  1.239201  0.500000  0.000000
1 -0.118521  0.500000  0.000000
2  1.485005  0.500000  0.530194
3  0.126152  0.500000  0.110065
4  0.505513 -0.862815  0.308921
5  0.259790 -0.118893  0.886090
6  0.582531  0.769109  1.058790

In [183]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -1.373312  0.526507 -0.332390
1  2.228791 -0.519219 -1.955374
2 -1.314652       NaN -0.971352
3 -0.488907       NaN  0.863870
4  0.316439       NaN       NaN
5 -1.227110       NaN       NaN

In [184]:
df.fillna(method='ffill')  # Forward fill NaN values

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\2883871002.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')  # Forward fill NaN values

          0         1         2
0 -1.373312  0.526507 -0.332390
1  2.228791 -0.519219 -1.955374
2 -1.314652 -0.519219 -0.971352
3 -0.488907 -0.519219  0.863870
4  0.316439 -0.519219  0.863870
5 -1.227110 -0.519219  0.863870

In [185]:
df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\3537515366.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

          0         1         2
0 -1.373312  0.526507 -0.332390
1  2.228791 -0.519219 -1.955374
2 -1.314652 -0.519219 -0.971352
3 -0.488907 -0.519219  0.863870
4  0.316439       NaN  0.863870
5 -1.227110       NaN  0.863870

In [186]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [187]:
data.fillna(data.mean())  # Fill NaN values with the mean of the Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [188]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [189]:
data.duplicated()  # Check for duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [190]:
data.drop_duplicates()  # Drop duplicate rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [191]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [192]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [193]:
data.drop_duplicates(subset=["k1"])  # Drop duplicates based on column 'k1'

    k1  k2  v1
0  one   1   0
1  two   1   1

In [194]:
data.drop_duplicates(["k1", "k2"], keep="last")  # Drop duplicates based on columns 'k1' and 'k2'

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [195]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [196]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [197]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [198]:
data =pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [199]:
data.replace(-999, np.nan)  # Replace -999 with NaN

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [200]:
data.replace([-999, -1000], np.nan)  # Replace -999 and -1000 with NaN

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [201]:
data.replace([-999, -1000], [np.nan, 0])  # Replace -999 with NaN and -1000 with 0

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [202]:
data.replace({-999:np.nan, -1000:0})  # Replace -999 with NaN and -1000 with 0 using a dictionary

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [203]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

### Renaming Axis Indexes

In [204]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), 
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [205]:
def transform(x):
    return x[:4].upper()
data.index = data.index.map(transform)

In [206]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [207]:
data.rename(index=str.title, columns=str.upper)  # Rename index and columns with functions

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [208]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [209]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})  # Rename specific index and column labels

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [210]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### Discretization and Binning

In [211]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [212]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [213]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [214]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [215]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [216]:
pd.value_counts(age_categories)

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [217]:
pd.cut(ages, bins, right=False)  # Left-inclusive bins

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [218]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)  # Use custom labels for the bins

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [219]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)  # Cut into 4 equal-width bins with 2 decimal places

[(0.74, 0.98], (0.74, 0.98], (0.5, 0.74], (0.74, 0.98], (0.5, 0.74], ..., (0.5, 0.74], (0.5, 0.74], (0.021, 0.26], (0.26, 0.5], (0.5, 0.74]]
Length: 20
Categories (4, interval[float64, right]): [(0.021, 0.26] < (0.26, 0.5] < (0.5, 0.74] < (0.74, 0.98]]

In [220]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)  # Cut into 4 equal-size bins with 2 decimal places
quartiles

[(0.62, 3.44], (-0.064, 0.62], (-0.8, -0.064], (-0.064, 0.62], (-0.8, -0.064], ..., (-3.25, -0.8], (-3.25, -0.8], (-0.064, 0.62], (-0.064, 0.62], (0.62, 3.44]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.25, -0.8] < (-0.8, -0.064] < (-0.064, 0.62] < (0.62, 3.44]]

In [221]:
pd.value_counts(quartiles)

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.25, -0.8]     250
(-0.8, -0.064]    250
(-0.064, 0.62]    250
(0.62, 3.44]      250
Name: count, dtype: int64

In [222]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0]).value_counts()

(-3.237, -1.426]     100
(-1.426, -0.0645]    400
(-0.0645, 1.229]     400
(1.229, 3.437]       100
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [223]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033081     0.046564     0.008003    -0.015207
std       1.010253     1.023537     0.999310     0.998509
min      -3.456102    -3.797026    -3.346552    -3.964697
25%      -0.757640    -0.622689    -0.655256    -0.662225
50%      -0.044960     0.061005    -0.006204     0.005148
75%       0.629371     0.744681     0.651685     0.675631
max       2.977914     2.988039     3.472107     3.242131

In [224]:
col = data[2]
col[col.abs() > 3]

6      3.390224
397   -3.346552
499    3.472107
Name: 2, dtype: float64

In [225]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
6   -1.172395  0.490501  3.390224 -1.070172
322 -0.939130  1.803860 -0.778505 -3.326538
397 -0.914182  0.784259 -3.346552  1.340695
497  0.593958  0.733829  1.560008 -3.104325
499  0.499378  0.037669  3.472107  0.808614
571 -1.509301  0.510703 -0.597099  3.206474
762 -3.456102  0.062316  0.122573  0.120912
807  0.532085  0.773672 -2.179810 -3.964697
808 -0.927277 -0.680725  0.760589 -3.015657
882  1.584149 -3.797026 -0.314972 -0.545808
944 -0.540308 -0.518134  0.050300  3.242131

In [226]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.032625     0.047361     0.007488    -0.014245
std       1.008808     1.020847     0.995426     0.992334
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.757640    -0.622689    -0.655256    -0.662225
50%      -0.044960     0.061005    -0.006204     0.005148
75%       0.629371     0.744681     0.651685     0.675631
max       2.977914     2.988039     3.000000     3.000000

In [227]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4 -1.0 -1.0 -1.0  1.0

### Permutation and Random Sampling

In [228]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [229]:
sampler = np.random.permutation(5)
sampler

array([3, 4, 0, 1, 2], dtype=int32)

In [230]:
len(df)

5

In [231]:
df.take(sampler)  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [232]:
df.iloc[sampler]  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [233]:
df.sample(n=3)  # Randomly sample 3 rows from the DataFrame

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20

In [234]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [235]:
choices.sample(n=10, replace=True)  # Sample with replacement

4    4
2   -1
4    4
3    6
0    5
3    6
3    6
4    4
4    4
3    6
dtype: int64

In [236]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [237]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [238]:
pd.get_dummies(df["key"]).astype(int)  # One-hot encoding

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [239]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=int)  # Prefix for the column names
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [240]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [241]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python",
                       encoding="latin-1")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [242]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [243]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [244]:
np.random.seed(12345)
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [248]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins), dtype=int)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 Extension Data Types

In [249]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [250]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [251]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [252]:
s.dtype

Int64Dtype()

In [253]:
s[3] is pd.NA

True

In [254]:
s = pd.Series([1, 2, 3, None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [255]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [256]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "c": [False, None, False, True]})
df

     A      B      c
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [257]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["c"] = df["c"].astype("boolean")
df

      A      B      c
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True